{"meta":{"title":"枳暮","subtitle":"","description":"","author":"枳暮","url":"https://maplepoet.github.io/hexo","root":"/hexo/"},"posts":[{"title":"AWS_Solution_Architect","date":"2024-05-22T15:27:12.000Z","path":"2024/05/22/AWS-Solution-Architect/","permalink":"https://maplepoet.github.io/hexo/2024/05/22/AWS-Solution-Architect/","categories":[],"tags":[],"excerpt":"The AWS Certified Solutions Architect – Associate certification demonstrates your knowledge and skills across a wide range of AWS services. As an associate-level certification, it focuses on designing cost-effective and high-performance solutions. Key areas covered include understanding the AWS Well-Architected Framework, deploying and managing workloads on AWS, implementing security controls, and using the AWS Management Console and Command Line Interface (CLI)."},{"title":"VueJS","date":"2024-05-22T15:23:37.000Z","path":"2024/05/22/VueJS/","permalink":"https://maplepoet.github.io/hexo/2024/05/22/VueJS/","categories":[],"tags":[],"excerpt":"Vue.js strikes a balance between simplicity, performance, and flexibility. Its reactive nature, composable components, and approachable API make it a popular choice for web development. If you’re interested in exploring Vue.js further, check out the official Vue.js website for comprehensive documentation and examples."},{"title":"PostgreSQL","date":"2024-05-22T15:13:21.000Z","path":"2024/05/22/PostgreSQL/","permalink":"https://maplepoet.github.io/hexo/2024/05/22/PostgreSQL/","categories":[],"tags":[],"excerpt":"PostgreSQL is a powerful, open-source object-relational database system that combines the SQL language with numerous features for safely storing and scaling complex data workloads. It originated in 1986 as part of the POSTGRES project at the University of California, Berkeley. With over 35 years of active development, PostgreSQL has earned a strong reputation for its proven architecture, reliability, data integrity, robust feature set, and extensibility. It runs on major operating systems, adheres to ACID compliance, and includes add-ons like the popular PostGIS geospatial database extender. Developers appreciate its extensibility, allowing custom data types and functions without recompiling the database. PostgreSQL conforms to SQL standards and continues to evolve, making it a top choice for many organizations."},{"title":"Kubernetes","date":"2024-03-07T13:38:58.000Z","path":"2024/03/07/Kubernetes/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/Kubernetes/","categories":[],"tags":[],"excerpt":"Kubernetes, also known as K8s, is an open-source system for automating deployment, scaling, and management of containerized applications. It groups containers that make up an application into logical units for easy management and discovery. Originally designed by Google, the project is now maintained by a worldwide community of contributors, with the trademark held by the Cloud Native Computing Foundation. Kubernetes assembles one or more computers, either virtual machines or bare metal, into a cluster that can run workloads in containers. It works with various container runtimes, such as containerd and CRI-O. Its suitability for running and managing workloads of all sizes and styles has led to widespread adoption in clouds and data centers. Kubernetes is widely deployed across companies including Google, Microsoft, Amazon, Apple, Meta, Nvidia, Reddit, Pinterest, and thousands of other companies."},{"title":"Docker","date":"2024-03-07T13:38:52.000Z","path":"2024/03/07/Docker/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/Docker/","categories":[],"tags":[],"excerpt":"Docker is an open platform for developing, shipping, and running applications. It simplifies the process of building, running, managing, and distributing software by virtualizing the operating system of the host computer."},{"title":"Terraform","date":"2024-03-07T13:38:28.000Z","path":"2024/03/07/Terraform/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/Terraform/","categories":[],"tags":[],"excerpt":"Terraform is an infrastructure as code (IaC) tool that enables developers to define cloud and on-premises resources using human-readable configuration files. With Terraform, you can build, modify, and version your infrastructure efficiently."},{"title":"Ansible","date":"2024-03-07T13:38:22.000Z","path":"2024/03/07/Ansible/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/Ansible/","categories":[],"tags":[],"excerpt":"Ansible is an open-source IT automation engine that enables infrastructure as code. It provides a suite of software tools for provisioning, configuration management, and application deployment. Originally developed by Michael DeHaan in 2012, Ansible was later acquired by Red Hat. Unlike some other configuration management tools, Ansible follows an agentless architecture, meaning it doesn’t require software installation on the controlled nodes. Instead, it relies on temporary remote connections via SSH or Windows Remote Management. Ansible’s inventory is stored in plain text files and can be dynamically sourced from cloud-based formats like YAML or INI. It’s widely used for automating tasks across Unix-like systems and Microsoft Windows."},{"title":"AWS","date":"2024-03-07T13:38:14.000Z","path":"2024/03/07/AWS/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/AWS/","categories":[],"tags":[],"excerpt":"Amazon Web Services (AWS) is the world’s most comprehensive and broadly adopted cloud platform. It offers over 200 fully featured services, available from data centers globally. Here are some key points about AWS: Compute Services: AWS Elastic Compute Cloud (EC2) allows developers to build, deploy, and scale applications in the cloud. EC2 instances provide virtual servers with flexible configurations. Storage: AWS provides various storage services, including Amazon S3 for web data storage and Amazon EBS for block storage. These services offer scalability, durability, and low-latency access. Databases: AWS offers managed database services like Amazon RDS (Relational Database Service) and Amazon DynamoDB (NoSQL database). These services are cost-efficient, secure, and scalable. Networking and Content Delivery: AWS provides Virtual Private Cloud (VPC) for network isolation, Amazon CloudFront for content delivery, and Route 53 for domain management. Developer Tools: AWS offers tools like AWS Lambda (serverless computing), Amazon CodeDeploy (deployment automation), and Amazon CloudWatch (monitoring and logging). Security and Compliance: AWS is architected for security, with over 300 security, compliance, and governance services. It supports 143 security standards and certifications. Innovation: AWS continually introduces new technologies, such as serverless computing and machine learning services like Amazon SageMaker."},{"title":"Kafka Zookeeper","date":"2024-03-07T13:38:06.000Z","path":"2024/03/07/Kafka-Zookeeper/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/Kafka-Zookeeper/","categories":[],"tags":[],"excerpt":"Kafka is a distributed streaming platform designed for handling real-time data streams and building data pipelines.ZooKeeper is a centralized service that provides distributed coordination and maintains configuration information."},{"title":"WSL usage","date":"2024-03-07T12:23:01.000Z","path":"2024/03/07/WSL-usage/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/WSL-usage/","categories":[],"tags":[{"name":"WSL","slug":"WSL","permalink":"https://maplepoet.github.io/hexo/tags/WSL/"},{"name":"Linux","slug":"Linux","permalink":"https://maplepoet.github.io/hexo/tags/Linux/"},{"name":"Windows","slug":"Windows","permalink":"https://maplepoet.github.io/hexo/tags/Windows/"}],"excerpt":"Windows Subsystem for Linux (WSL) is a feature of Windows 10 that bridges the gap between Windows and Linux environments. With WSL, you can run native Linux command-line tools directly on your Windows machine without the need for a separate virtual machine or dual booting. It provides a seamless experience for developers who want to work with both Windows and Linux simultaneously."},{"title":"Hello World","date":"2024-03-07T10:23:01.000Z","path":"2024/03/07/hello-world/","permalink":"https://maplepoet.github.io/hexo/2024/03/07/hello-world/","categories":[],"tags":[],"excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub."}],"categories":[],"tags":[{"name":"WSL","slug":"WSL","permalink":"https://maplepoet.github.io/hexo/tags/WSL/"},{"name":"Linux","slug":"Linux","permalink":"https://maplepoet.github.io/hexo/tags/Linux/"},{"name":"Windows","slug":"Windows","permalink":"https://maplepoet.github.io/hexo/tags/Windows/"}]}